app/controllers/entries_controller.rb

  def index
    @projects = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]

  def new
    @project = Project.find params[:project_id]
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 25]]

  def create
    # Find the project
    @project = Project.find(params[:project_id])
    # New entry
    @entry = @project.entries.new entry_params
    # Try to save it
    if @entry.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 25]]
INSERT INTO "entries" ("hours", "minutes", "date", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["hours", 1], ["minutes", 3], ["date", "2016-02-25 00:00:00.000000"], ["project_id", 25], ["created_at", "2016-02-24 13:44:27.466808"], ["updated_at", "2016-02-24 13:44:27.466808"]]

  def edit
    @project = Project.find(params[:project_id])
    @entry = @project.entries.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 25]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 25], ["id", 25]]

  def update
    @project = Project.find(params[:project_id])
    @entry = @project.entries.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 25]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 25], ["id", 25]]

  def destroy
    @project = Project.find(params[:project_id])
    @entry = @project.entries.find(params[:id])
    @entry.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 25]]
SELECT  "entries".* FROM "entries" WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 25], ["id", 25]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 25]]