app/controllers/projects_controller.rb

  def index
    @projects = Project.last_created_proyects(15)
    if @projects.empty?
---
SELECT  "projects".* FROM "projects"  ORDER BY "projects"."created_at" DESC LIMIT 15
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "projects" LIMIT 15) subquery_for_count

  def show
    @projects = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 0]]